aws/amazon-freertos/vendors/renesas/FIT/RDP_v1.15_modified/r_s12ad_rx/src/targets/rx130/r_s12ad_rx130.c
/***********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No 
* other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all 
* applicable laws, including copyright laws. 
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY, 
* FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM 
* EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES 
* SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS 
* SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of 
* this software. By using this software, you agree to the additional terms and conditions found by accessing the 
* following link:
* http://www.renesas.com/disclaimer 
*
* Copyright (C) 2016-2017 Renesas Electronics Corporation. All rights reserved.
***********************************************************************************************************************/
/***********************************************************************************************************************
* File Name    : r_s12ad_rx130.c
* Description  : Primary source code for 12-bit A/D Converter driver.
***********************************************************************************************************************/
/**********************************************************************************************************************
* History : DD.MM.YYYY Version Description
*           01.03.2016 1.00    Initial Release.
*           01.10.2016 2.20    Define name commoditize for the same meaning but different name define.
*                              Delete parameter check by the enum value.
*                              Initialize ADGSPCR register when mode without Group scan mode.
*                              Comparison parameter change.(adjust the parameter structure to RX65N)
*                              Bug fix for Comparison can not stop after start.
*                              Bug fix for Can not choice both self-diag and dda.
*                              Bug fix for self-diag can set during Single scan mode(double trigger).
*                              adc_enable_s12gbadi() declaration change that same as prototype declaration.
*           03.04.2017 2.30    R_ADC_Control function returns ADC_ERR_INVALID_ARG when set to group B or PGS bit
*                               except for Group scan mode.
*                              Corresponding to the notice when setting the PGS bit in the ADGSPCR register to 1.
*                              Added RX130-512KB support.
***********************************************************************************************************************/

/***********************************************************************************************************************
Includes   <System Includes> , "Project Includes"
***********************************************************************************************************************/
/* Includes board and MCU related header files. */
#include <stdio.h>
#include "platform.h"

#if defined (BSP_MCU_RX130)
#include "r_s12ad_rx_config.h"
#include "r_s12ad_rx_private.h"
#include "r_s12ad_rx_if.h"

/***********************************************************************************************************************
Macro definitions
***********************************************************************************************************************/

/***********************************************************************************************************************
Typedef definitions
***********************************************************************************************************************/
typedef volatile __evenaccess struct st_s12ad  aregs_t;

/***********************************************************************************************************************
Private global variables and functions
***********************************************************************************************************************/
#if ADC_CFG_PARAM_CHECKING_ENABLE == 1
static adc_err_t adc_check_open_cfg(adc_mode_t  const  mode,
                                    adc_cfg_t * const  p_cfg,
                                    void     (* const  p_callback)(void *p_args));

static adc_err_t adc_check_scan_config(adc_ch_cfg_t *p_config);
#endif

static adc_err_t adc_configure_scan(adc_ch_cfg_t *p_config);
extern void adc_enable_s12adi0(void);
static void adc_enable_s12gbadi(void);
static adc_err_t adc_en_comparator_level0(adc_cmpwin_t  *p_cmpwin);
static uint32_t adc_get_and_clr_cmpi_flags(void);


/* In RAM */
extern adc_ctrl_t g_dcb;

/* In ROM. A/D Data Register pointers */
volatile __evenaccess uint16_t * const  dreg_ptrs[ADC_REG_MAX+1] =
                      { &S12AD.ADDR0,     // channel 0
                        &S12AD.ADDR1,     // channel 1
                        &S12AD.ADDR2,     // channel 2
                        &S12AD.ADDR3,     // channel 3
                        &S12AD.ADDR4,     // channel 4
                        &S12AD.ADDR5,     // channel 5
                        &S12AD.ADDR6,     // channel 6
                        &S12AD.ADDR7,     // channel 7
                        &S12AD.ADDR16,    // channel 16
                        &S12AD.ADDR17,    // channel 17
                        &S12AD.ADDR18,    // channel 18
                        &S12AD.ADDR19,    // channel 19
                        &S12AD.ADDR20,    // channel 20
                        &S12AD.ADDR21,    // channel 21
                        &S12AD.ADDR22,    // channel 22
                        &S12AD.ADDR23,    // channel 23
                        &S12AD.ADDR24,    // channel 24
                        &S12AD.ADDR25,    // channel 25
                        &S12AD.ADDR26,    // channel 26
                        &S12AD.ADDR27,    // channel 27
                        &S12AD.ADDR28,    // channel 28
                        &S12AD.ADDR29,    // channel 29
                        &S12AD.ADDR30,    // channel 30
                        &S12AD.ADDR31,    // channel 31
                        &S12AD.ADTSDR,    // temperature sensor
                        &S12AD.ADOCDR,    // voltage sensor
                        &S12AD.ADDBLDR,   // Data Duplication register
                        &S12AD.ADRD.WORD  // self-diagnosis register
                      };


