aws/amazon-freertos/vendors/renesas/FIT/RDP_v1.15_modified/r_s12ad_rx/src/targets/rx130/r_s12ad_rx130.c
    /* DO UNIVERSAL PARAMETER CHECKING */

#if (ADC_CFG_PARAM_CHECKING_ENABLE == 1)

    if ((p_args == NULL) || (p_args == FIT_NO_PTR))
    {
        if ((cmd == ADC_CMD_SET_DDA_STATE_CNT)
         || (cmd == ADC_CMD_SET_SAMPLE_STATE_CNT)
         || (cmd == ADC_CMD_ENABLE_CHANS)
         || (cmd == ADC_CMD_EN_COMPARATOR_LEVEL)
         || (cmd == ADC_CMD_EN_COMPARATOR_WINDOW)
         || (cmd == ADC_CMD_CHECK_CONDITION_MET))
        {
            return ADC_ERR_MISSING_PTR;
        }
    }
#endif

    /* PROCESS INDIVIDUAL COMMANDS */

    switch (cmd)
    {
    case ADC_CMD_USE_VREFH0:
        S12AD.ADHVREFCNT.BIT.HVSEL = 1;
    break;

    case ADC_CMD_USE_VREFL0:
        S12AD.ADHVREFCNT.BIT.LVSEL = 1;
    break;

    /* Set up Disconnect Detection Assist*/
    case ADC_CMD_SET_DDA_STATE_CNT:
        p_charge = (adc_dda_t *)p_args;            //Get the command arguments
#if (ADC_CFG_PARAM_CHECKING_ENABLE == 1)
        if (p_charge->method != ADC_DDA_OFF)
        {
            /* Cannot have temp sensor output or V-reference conversion enabled and Disconnect Detection enabled. */
            if ((p_charge->num_states < ADC_DDA_STATE_CNT_MIN)
             || (p_charge->num_states > ADC_DDA_STATE_CNT_MAX)
             || ((p_regs->ADEXICR.WORD & 0x0300) != 0)) // Temp sensor or V-ref enabled
            {
                return ADC_ERR_ILLEGAL_ARG;
            }
        }
#endif
        if (p_charge->method == ADC_DDA_OFF)
        {
            p_regs->ADDISCR.BYTE = 0;              //Disable Disconnect Detection Assist
        }
        else
        {
            // NOTE: Using Disconnect Detection Assist adds num_states x (#chans) ADCLKS to scan time
            p_regs->ADDISCR.BYTE = (uint8_t)((p_charge->method == ADC_DDA_PRECHARGE) ? 0x10 : 0);
            p_regs->ADDISCR.BYTE |= p_charge->num_states;
        }
    break;

    case ADC_CMD_SET_SAMPLE_STATE_CNT:
        p_sample = (adc_sst_t *)p_args;            //Get the command arguments
#if ADC_CFG_PARAM_CHECKING_ENABLE == 1
        if (p_sample->num_states < ADC_SST_CNT_MIN)
        {
            return ADC_ERR_INVALID_ARG;
        }
#endif
        *(sreg_ptrs)[p_sample->reg_id] = p_sample->num_states;
    break;

    case ADC_CMD_ENABLE_CHANS:
        err = adc_configure_scan((adc_ch_cfg_t *)p_args);
    break;

    case ADC_CMD_EN_COMPARATOR_LEVEL:
        p_cmpwin = (adc_cmpwin_t *)p_args;
        p_regs->ADCMPCR.BIT.WCMPE = 0;          // Disable the window function. Compare level

        err = adc_en_comparator_level0(p_cmpwin);
    break;


    case ADC_CMD_ENABLE_TEMP_SENSOR:
#if ADC_CFG_PARAM_CHECKING_ENABLE == 1
        if (g_dcb.mode != ADC_MODE_SS_TEMPERATURE)
        {
            return ADC_ERR_ILLEGAL_ARG;
        }
#endif
        S12AD.ADEXICR.BIT.TSSA = 1;              // select temperature output on Single scan mode
        if (S12AD.ADADC.BIT.ADC != ADC_ADD_OFF)
        {
            S12AD.ADEXICR.BIT.TSSAD = 1;         // enable addition
        }
        adc_enable_s12adi0();                    // setup interrupt handling
    break;


    case ADC_CMD_ENABLE_VOLT_SENSOR:
#if ADC_CFG_PARAM_CHECKING_ENABLE == 1
        if (g_dcb.mode != ADC_MODE_SS_INT_REF_VOLT)
        {
            return ADC_ERR_ILLEGAL_ARG;
        }
#endif
        S12AD.ADEXICR.BIT.OCSA = 1;              // select internal reference voltage output on Single scan mode
        if (S12AD.ADADC.BIT.ADC != ADC_ADD_OFF)
        {
            S12AD.ADEXICR.BIT.OCSAD = 1;         // enable addition
        }
        adc_enable_s12adi0();                    // setup interrupt handling
    break;


    case ADC_CMD_EN_COMPARATOR_WINDOW:
        p_cmpwin = (adc_cmpwin_t *)p_args;
#if ADC_CFG_PARAM_CHECKING_ENABLE == 1
        if (p_cmpwin->level_lo > p_cmpwin->level_hi)
        {
            return ADC_ERR_ILLEGAL_ARG;
        }
#endif
        p_regs->ADCMPCR.BIT.WCMPE = 1;           // Enable window function

        err = adc_en_comparator_level0(p_cmpwin);
    break;

    /* Enable A/D conversion to be started by synchronous or asynchronous trigger */
    case ADC_CMD_ENABLE_TRIG:
        p_regs->ADCSR.BIT.TRGE = 1;           // enable sync/async triggers
    break;

    /* Disable A/D conversion to be started by synchronous or asynchronous trigger */
    case ADC_CMD_DISABLE_TRIG:
        p_regs->ADCSR.BIT.TRGE = 0;           // disable sync/async triggers
    break;

    /* Start the A/D conversion process */
    case ADC_CMD_SCAN_NOW:
        if (p_regs->ADCSR.BIT.ADST == 0)
        {
            p_regs->ADCSR.BIT.ADST = 1;
        }
        else
        {
            err = ADC_ERR_SCAN_NOT_DONE;
        }
    break;

    /* Check for completion of the current scan. */
    case ADC_CMD_CHECK_SCAN_DONE:
        if (p_regs->ADCSR.BIT.ADST == 1)
        {
            err = ADC_ERR_SCAN_NOT_DONE;
        }
    break;

    /* Check for completion of the current scan. */
    case ADC_CMD_CHECK_SCAN_DONE_GROUPA:
        if (IR(S12AD,S12ADI0) == 1)
        {
            IR(S12AD,S12ADI0) = 0;
        }
        else
        {
            err = ADC_ERR_SCAN_NOT_DONE;
        }
    break;

    /* Check for completion of the current groupB scan. */
    case ADC_CMD_CHECK_SCAN_DONE_GROUPB:
        if (IR(S12AD,GBADI) == 1)
        {
            IR(S12AD,GBADI) = 0;
        }
        else
        {
            err = ADC_ERR_SCAN_NOT_DONE;
        }
    break;

    case ADC_CMD_CHECK_CONDITION_MET:
        flags = adc_get_and_clr_cmpi_flags();
        if (flags == 0)
        {
            err = ADC_ERR_CONDITION_NOT_MET;
        }
        *((uint32_t *)p_args) = flags;
    break;

    case ADC_CMD_ENABLE_INT:
        p_regs->ADCSR.BIT.ADIE = 1;    // Enable Scan End Interrupt (S12ADI0)
    break;

    case ADC_CMD_DISABLE_INT:
        p_regs->ADCSR.BIT.ADIE = 0;    // Disable Scan End Interrupt (S12ADI0)
    break;

    case ADC_CMD_ENABLE_INT_GROUPB:
        p_regs->ADCSR.BIT.GBADIE = 1;  // Enable Group B Scan End Interrupt (GBADI)
    break;

    case ADC_CMD_DISABLE_INT_GROUPB:
        p_regs->ADCSR.BIT.GBADIE = 0;  // Disable Group B Scan End Interrupt (GBADI)
    break;

    default:
        err = ADC_ERR_INVALID_ARG;
    break;
    }

