aws/amazon-freertos/vendors/renesas/FIT/RDP_v1.15_modified/r_s12ad_rx/src/targets/rx130/r_s12ad_rx130.c
    return err;
}

/******************************************************************************
* Function Name: adc_en_comparator_level0
* Description  : This function sets up the comparator for level0 threshold
*              : compare. The processing is identical for window except
*              : for the setting of the window enable bit and the level1
*              : value (ADCMPDR1).
*              :
* Arguments    : p_cmpwin -
*              :     Pointer to comparator level/window compare structure
*              :
* Return Value :ADC_SUCCESS-
*              :     Successful
*              : ADC_ERR_INVALID_ARG-
*              :     reg_id contains an invalid value.
*              : ADC_ERR_ILLEGAL_ARG-
*              :     an argument is illegal based upon rest of configuration
*              : ADC_ERR_TRIG_ENABLED -
*              :     Cannot configure comparator while scans are running
*              :
*******************************************************************************/
static adc_err_t adc_en_comparator_level0(adc_cmpwin_t  *p_cmpwin)
{
    aregs_t *p_regs = (aregs_t *)&S12AD;

#if ADC_CFG_PARAM_CHECKING_ENABLE == 1
    if ((p_cmpwin->compare_mask & ADC_INVALID_CH_MASK) != 0)    // checking exist channel
    {
        return ADC_ERR_INVALID_ARG;
    }
    if ((p_cmpwin->inside_window_mask | p_cmpwin->compare_mask) != p_cmpwin->compare_mask)  // checking compare channel combination
    {
        return ADC_ERR_INVALID_ARG;
    }
    if (p_regs->ADCSR.BIT.DBLE == 1)                            // Comparison disable when Double trigger mode
    {
        return ADC_ERR_INVALID_ARG;
    }
    if (p_regs->ADCER.BIT.DIAGM != 0)                           // Comparison disable when Self-diagnosis mode
    {
        return ADC_ERR_INVALID_ARG;
    }
    if ((g_dcb.mode == ADC_MODE_SS_TEMPERATURE) && (p_cmpwin->compare_mask != ADC_MASK_TEMP))   // checking use channel
    {
        return ADC_ERR_INVALID_ARG;
    }
    if ((g_dcb.mode == ADC_MODE_SS_INT_REF_VOLT) && (p_cmpwin->compare_mask != ADC_MASK_VOLT))  // checking use channel
    {
        return ADC_ERR_INVALID_ARG;
    }
#endif

    if (p_regs->ADCSR.BIT.TRGE == 1)
    {
        return ADC_ERR_TRIG_ENABLED;    // ADST must be 0 to configure comparator
    }


    /* CONFIGURE COMPARATOR */

    if (true == p_cmpwin->windowa_enable) // COMPARATOR A
    {
        p_regs->ADCMPCR.BIT.CMPAE = 0;          // Compare window A operation is disabled

        p_regs->ADCMPDR0 = p_cmpwin->level_lo;      // set lo end of window or set level
        if (p_regs->ADCMPCR.BIT.WCMPE == 1)
        {
            p_regs->ADCMPDR1 = p_cmpwin->level_hi;  // set hi end of window
        }

        p_regs->ADCMPANSR0.WORD = p_cmpwin->compare_mask & 0x00FF;      // Select channels to compare.  Channels 0 to 7.
        p_regs->ADCMPLR0.WORD = p_cmpwin->inside_window_mask & 0x00FF;  // Select the CoMPare Level. Channels 0 to 7.

        S12AD.ADCMPANSR1.WORD = (p_cmpwin->compare_mask>>16) & 0xFFFF;  // Select channels to compare. 16 to 31.
        S12AD.ADCMPLR1.WORD = (p_cmpwin->inside_window_mask>>16) & 0xFFFF;

        S12AD.ADCMPANSER.BIT.CMPTSA = (p_cmpwin->compare_mask & ADC_MASK_TEMP) ? 1 : 0;
        S12AD.ADCMPANSER.BIT.CMPOCA = (p_cmpwin->compare_mask & ADC_MASK_VOLT) ? 1 : 0;

        S12AD.ADCMPLER.BIT.CMPLTSA = (p_cmpwin->inside_window_mask & ADC_MASK_TEMP) ? 1 : 0;
        S12AD.ADCMPLER.BIT.CMPLOCA = (p_cmpwin->inside_window_mask & ADC_MASK_VOLT) ? 1 : 0;

        p_regs->ADCMPCR.BIT.CMPAE = 1;          // Compare window A operation is enabled
    }
    else
    {
        p_regs->ADCMPCR.BIT.CMPAE = 0;          // Compare window A operation is disabled
    }

    return ADC_SUCCESS;
}

/*****************************************************************************
* Function Name: adc_get_and_clr_cmpi_flags
* Description  : Returns flags for all channels/sensors that met comparator
*                condition and clears the flags for next interrupt.
* Arguments    : none
* Return Value : channels/sensors that met comparator condition
******************************************************************************/
static uint32_t adc_get_and_clr_cmpi_flags(void)
{
uint32_t    flags;

    /* Get flags for channels AN00 to AN07 */
    flags = (uint32_t)S12AD.ADCMPSR0.WORD;
    S12AD.ADCMPSR0.WORD = 0;

    /* Get flags for channels AN16 to AN31 */
    flags |= (uint32_t)S12AD.ADCMPSR1.WORD << 16;
    S12AD.ADCMPSR1.WORD = 0;

    /* Get flags for Temperature sensor and internal Voltage Reference */
    flags |= (S12AD.ADCMPSER.BIT.CMPSTTSA == 1) ? ADC_MASK_TEMP : 0;
    flags |= (S12AD.ADCMPSER.BIT.CMPSTOCA == 1) ? ADC_MASK_VOLT : 0;
    S12AD.ADCMPSER.BYTE = 0;

    return flags;
}

/******************************************************************************
* Function Name: adc_configure_scan
* Description  : This function does extensive checking on channel mask
*                settings based upon operational mode. Mask registers are
*                initialized and interrupts enabled in peripheral. Interrupts
*                are also enabled in ICU if corresponding priority is not 0.
*
* Arguments    : p_config -
*                    Pointer to channel config structure containing masks
* Return Value : ADC_SUCCESS-
*                    Successful
*******************************************************************************/
static adc_err_t adc_configure_scan(adc_ch_cfg_t   *p_config)
{
uint16_t  i=0;
uint32_t  tmp_mask=0;
aregs_t   *p_regs = (aregs_t *)&S12AD;
uint16_t  trig_a;
uint16_t  trig_b;

#if ADC_CFG_PARAM_CHECKING_ENABLE == 1
    adc_err_t   err;

    err = adc_check_scan_config(p_config);
    if (err != ADC_SUCCESS)
    {
        return err;
    }
#endif // parameter checking

    /* SET MASKS FOR CHANNELS AND SENSORS */
    /* Select the channels from among Ch0 to Ch7 for conversion */
    p_regs->ADANSA0.WORD = (uint16_t) (p_config->chan_mask & 0x00FF);            //CH0 to CH7
    p_regs->ADANSB0.WORD = (uint16_t) (p_config->chan_mask_groupb & 0x00FF);     //CH0 to CH7

    /* Select the channels for Addition/Averaging (ch0 to ch7) */
    p_regs->ADADS0.WORD  = (uint16_t) (p_config->add_mask & 0x00FF);             //CH0 to CH7

    /* Select the channels from among Ch16 to Ch31 for conversion */
    S12AD.ADANSA1.WORD = (uint16_t) ((p_config->chan_mask >> 16) & 0xFFFFF);      //CH16 to CH31
    S12AD.ADANSB1.WORD = (uint16_t) ((p_config->chan_mask_groupb >> 16) & 0xFFFF);

